;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------

[CALISET_DLG_102]
CAPTION = برنامج تصحيح HL
ID1022 = مجموعة الحلول
ID1023 = الرجاء تحديد:
ID1007 = حفظ آخر كما
ID1017 = حذف
ID1084 = الاستيراد
ID1085 = التصدير

ID1075 = الرأس الصحيح
ID1024 = المعلمات الأساسية
ID1025 = نطاق معدل (مم):
ID1026 = نطاق العلامات (مم):
ID1072 = نظام الإحداثيات
ID1077 = زاوية الدوران
ID1079 = X إزاحة (مم)
ID1080 = Y إزاحة (مم) (MM)
ID1119 = مرآة الاهتزاز 1 = x
ID1120 = مرآة الاهتزاز 2 = x
ID1116 = عكس
ID1117 = عكس

ID1030 = تصحيح الشبكة والمستوى (قم بربط مزدوج لإطفاء نافذة الحساب التلقائي بعد تحديد نسبة التكبير)
ID1009 = إضافة مستوى
ID1010 = مستوى حذف
ID1012 = التأثير الكلي متعدد المستويات
ID1031 = العودة إلى مستوى الكلمة:
ID1018 = الرسم البياني لأقصى مستوى لمستوى المستوى

ID1053 = تصحيح قوانغ الأحمر
ID1043 = تمكين
ID1054 = x نسبة القابلية للاستحسان:
ID1055 = y نسبة القابلية للاستحسان:
ID1056 = X الإزاحة (مم):
ID1057 = y الانحراف (مم):

ID1058 = التركيز
ID1065 = طريقة التركيز
ID1059 = نوع التركيز الديناميكي
ID1060 = وضع التحكم
ID1061 = تباعد رمح (مم)
ID1082 = إلى ارتفاع الطائرة العاملة (مم)
ID1063 = قيمة غنائية (أم)
ID1062 = معامل تعويض التركيز الديناميكي

ID1011 = اختبار F7
ID1037 = توقف
ID1014 = المعلمة >>

ID1109 = النوع الصحيح
ID1099 = تصحيح عادي
ID1100 = تصحيح عالي الدقة 1 [الماسح الضوئي]
ID1101 = تصحيح الدقة العالية [استيراد بيانات الإحداثيات الحقيقية]
ID1110 = عالية الدقة تصحيح الوصف : 1 ، أولا ، اختيار العام تصحيح التصحيح التقليدية ، وتنسيق النظام ، تصحيح الضوء الأحمر ، مربع الحجم و تشوه التكيف الأولي . 2 ، حدد تصحيح عالية الدقة ، وتوليد نقاط الشبكة . 3 ، مع أدوات مختلفة للحصول على البيانات وتجهيزها ، استيراد البيانات .
ID1114 = استيراد عالية الدقة تصحيح البيانات مباشرة

ID1089 = تصحيح العالي الدقة
ID1086 = إنشاء نقطة الشبكة
ID1111 = الخطوة الأولى: إنشاء نقطة الشبكة.
ID1112 = الخطوة 2: إدخال بيانات الإحداثيات الحقيقية المقاسة بواسطة الماسح الضوئي أو القياس الأبعاد.
ID1113 = الخطوة 3: إنشاء جدول تصحيح عالي الدقة وتأكيد مخرج الحفظ.

ID1096 = القياس
ID1027 = نطاق علامات عالية الدقة (مم)
ID1097 = عثرة
ID1028 = حجم مربع الاختبار (مم):
ID1091 = استيراد البيانات بعد معالجة الماسح الضوئي
ID1087 = استيراد بيانات
ID1016 = إنشاء جدول تصحيح عالي الدقة
ID1139 = توليد تصحيح الجدول 
ID1 = موافق
ID2 = إلغاء
ID1142 = وسم السيطرة

[CALISET_DLG_167]
CAPTION=  استيراد البيانات عالية الدقة
ID1114 = x ملف إحداثيات تم الحصول عليه بواسطة البعد الثاني:
ID1115 = ملف الإحداثيات Y الذي تم الحصول عليه بواسطة البعد الثاني:
ID1 = موافق
ID2 = إلغاء

[CALISET_DLG_159]
CAPTION = حفظ الحل
ID1036 = يتم تخزين مخطط التصحيح بشكل منفصل:
ID1 = موافق
ID2 = إلغاء

[CALISET_DLG_131]
CAPTION= معلمة علامات
ID1032 = عدد أوقات العلامات:
ID1033 = سرعة وضع العلامات (مم/ث)
ID1035 = الطاقة (٪)
ID1034 = Q تردد (KHz)
ID1036 = Q وقت الإصدار (الولايات المتحدة)
ID1037 = الكمون التوربيد بالليزر (الولايات المتحدة)
ID1 = موافق
ID2 = إلغاء

[CALISET_DLG_160]
Caption = تعيين معلومات العلامات التسمية
ID1093 = عدد الصفوف
ID1094 = رقم العمود
ID1116 = فقط تعيين عدد الرتب ، لا تميز
ID1 = علامات
ID2 = إلغاء
ID1099 = نقطة
ID1100 = الصليب
ID1101 = دائرة

[CALISET_DLG_164]
CAPTION = حدد بطاقة التحكم
ID1098 = الرجاء تحديد بطاقة عمل:
ID1 = موافق
ID2 = إلغاء

[Caliset_StringTable]
ID0 = حجم المربع (مم)
ID1 = x نسبة التكبير ٪ ٪
ID2 = y مقياس   ٪ ٪
ID3 = x تحقيقات
ID4 = y تصادم
ID5 = x شبه منحرف
ID6 = y شبه منحرف
ID7 = x متوازي
ID8 = y متوازي
ID9 = x نسبة إيجابية ٪ ٪
ID10 = x نسبة سالبة ٪ ٪ ٪
ID11 = y نسبة إيجابية ٪ ٪
ID12 = y نسبة سلبية ٪ ٪
ID13 = المعلمة \ المستوى
ID14 = الحالي (أ)
ID15 = الطاقة (٪)
ID16 = الحالي (٪)
ID17 = عرض نبض الليزر (NS)
ID18 = وضع الليزر
ID999 = لديه بالفعل برنامج علامات أو برنامج تصحيح يعمل ، يرجى إغلاقه أولاً!
ID1000 = ضائع أو تلف ملف القياس ، يرجى تأكيد ما إذا كان البرنامج طبيعيًا!
ID1001 = فشل تهيئة بطاقة التحكم في وضع العلامات!
ID1002 = فشلت إعدادات نظام بطاقة التحكم!
ID1003 = الرجاء تحديد مستوى التصحيح الذي تريد اختباره أولاً!
ID1004 = فشل العملية ، يرجى تجربتها لاحقًا!
ID1005 = هل هناك اسم مخطط موجود بالفعل؟
ID1006 = نطاق التصحيح لا يمكن أن يكون 0!
ID1007 = نطاق العلامة لا يمكن أن يكون 0!
ID1008 = المعامل النسبي لنطاق التصحيح ونطاق العلامات غير صحيح.
ID1011 = الرجاء تحديد المستوى لحذف المستوى
ID1012 = يرجى الحفاظ على تصحيح المستوى الأول على الأقل!
ID1013 = خطأ في الملف!
ID1014 = اضبط بيانات التصحيح على البطاقة فشل ، يرجى تجربتها لاحقًا!
ID1015 = مخطط تكوين التصحيح هذا لا يتماشى مع إصدار البرنامج الحالي. هل هو القراءة القسرية؟
ID1016 = حجم المربع لا يمكن أن يتجاوز نطاق العلامات!
ID1017 = حجم المربع لا يمكن أن يتجاوز حجم المستوى السابق!
ID1018 = تم تعديل إعدادات التصحيح الحالية ، هل تم تخزينها؟
ID1019 = فشل قراءة ملف!
ID1020 = تأكيد حذف المخطط الحالي؟
ID1021 = لم يتم اكتشاف كلاب البرمجيات!
ID1022 = يتم اكتشاف كلاب البرمجيات ، ولكن ليس كلاب البرمجيات القانونية!
ID1023 = هناك أكثر من برنامج قانوني واحد تم إدخاله!
ID1024 = تحويل الكلب الأولي إلى تشغيل كلب فشل!
ID1025 = "انتهت صلاحية ترخيص البرمجيات الحالية ، وتحتاج إلى الاتصال بموظفي خدمة العملاء لإعادة تطبيق لمطابقة تصحيح الترخيص (معرف الكلب = ٪ S ، رمز التحقق = ٪ S)
ID1026 = "D160"
ID1027 = "D480"
ID1028 = "CO2 تعزيز"
ID1029 = "CO2 تقليدي"
ID1030 = "فشل الإطلاق"
ID1031 = حجم المربع لا يمكن أن يكون أصغر من المستوى التالي!
ID1032 = وراء منطقة التصحيح الفعالة
ID1033 = "الآن التركيز"
ID1034 = "ثلاثي الأبعاد الديناميكية فحم الكوك"
ID1035 = "التركيز العادي الخلفي"
ID1036 = "وضع التحكم في الليزر البسيط يجب أن يكون أصغر من نطاق العلامات ٪ DMM" "
ID1037 = "فشل معرف الكلب الذي يتم تخزينه في البطاقة ، يرجى التحقق مما إذا كانت البطاقة ملزمة"
ID1038 = "الفشل في الاستيراد"
ID1039 = "استيراد نجاح"
ID1040 = "فشل التصدير"
ID1041 = "نجاح التصدير"
ID1042 = "عملية الفايل"
ID1043 = "بيانات الملف لا تتطابق"
ID1044 = "Focus 3D" بعد ذلك "
ID1045 = "X مسار الملف الإحداثي فارغ!"
ID1046 = "مسار ملف الإحداثيات فارغ!"
ID1047 = "الكلب الموجود على البطاقة لا يتوافق مع رقم الكلب المشفر"
ID1048 = "رقم البطاقة على البطاقة فارغ أو الطول غير صحيح" "

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1 = لم تتم تهيئة البطاقة أو لم يتم العثور على البطاقة!
2 = فشل إعادة التعيين!
3 = إصدار البطاقة غير صحيح!
4 = إنذار!
6=فشل التنفيذ!
7 = الحالة لا تتوافق!
16=انتهت مهلة الأمر!
17 = فقدت القيادة!
18 = استدعاء واجهة غير متزامن!
19=واجهة يشغلها برنامج آخر!
20=تجاوز المحور Z أو تصحيح تلف الملف!
21=عدم تطابق المعلمة!
23=فشل تخصيص الذاكرة!
100 = الاستخدام دون اتصال!
101=تم إحباط الأمر!
1001=المنفذ 1
1002=المنفذ 2
1003=المنفذ 3
1004=المنفذ 4
1005=المنفذ 5
1006=المنفذ 6
1007=المنفذ 7
1008 = إدخال الليزر غير جاهز
1009 = إدخال الليزر جاهز

[4]
1 = ارتفاع درجة حرارة الليزر ، يرجى إيقاف تشغيل الطاقة!
2 = الليزر عالية مكافحة الإنذار ، يرجى إيقاف تشغيل الطاقة!
3 = ليزر MO غير طبيعي ، يرجى إيقاف تشغيل الطاقة!
4 = غطاء الليزر مفتوح ، يرجى إيقاف تشغيل الطاقة وتثبيت غطاء الليزر!
5 = باب الأمان مفتوح ، يرجى إغلاقه!
6 = يتم إغلاق مصراع الكاميرا بشكل غير طبيعي ، يرجى إيقاف تشغيل الطاقة والتحقق من الغالق!
7 = الغالق غير مفتوح بشكل غير طبيعي ، يرجى إيقاف تشغيل الطاقة والتحقق من الغالق!
8 = باب الأمان مفتوح ، يتم إيقاف وضع العلامات مؤقتا ، يرجى إغلاق باب الأمان لمواصلة وضع العلامات!
9 = فتح بوابة الأمان ، تم إحباط الوسم!
10 = إنذار نظام الليزر ، يرجى إيقاف تشغيل الطاقة!
11 = جهد إمداد الليزر خارج النطاق ، يرجى إيقاف تشغيل الطاقة!
12 = إنذار الجهد الزائد لإمداد طاقة الليزر ، يرجى إيقاف تشغيل الطاقة والتحقق من طاقة الليزر!
13 = إنذار الجهد المنخفض لإمداد طاقة الليزر ، يرجى إيقاف تشغيل الطاقة والتحقق من طاقة الليزر!
14 = إنذار درجة الحرارة الزائدة بالليزر SPI ، يرجى إيقاف تشغيل الطاقة!
15 = إنذار التيار الزائد لمكبر الصوت الجاهز لليزر SPI ، يرجى إيقاف تشغيل الطاقة!
16 = إنذار التيار الزائد لمضخم طاقة الليزر SPI ، يرجى إيقاف تشغيل الطاقة!
17 = إنذار ليزر موازاة ليزر SPI ، يرجى إيقاف تشغيل الطاقة!
18 = إنذار الاحتفاظ بالليزر SPI ، يرجى إيقاف تشغيل الطاقة!
19 = إنذار طاقة الليزر SPI ، يرجى إيقاف تشغيل الطاقة!
20 = إنذار ليزر غير معروف ، يرجى إيقاف تشغيل الطاقة!
21 = إنذار التيار الزائد لطاقة الليزر ، يرجى إيقاف تشغيل الطاقة!
22 = إنذار الجهد الزائد لطاقة الليزر ، يرجى إيقاف تشغيل الطاقة!
23 = إنذار درجة حرارة الزائدة لطاقة الليزر ، يرجى إيقاف تشغيل الطاقة والتحقق من ظروف تبديد الحرارة!
24 = لم يتم تشغيل طاقة الليزر ، يرجى التحقق من مصدر الطاقة.
30= تمت مصادفة حد سلبي أثناء الحركة ، وتم إجهاض العلامات!
31= عند مواجهة حد إيجابي أثناء الحركة ، يتم إجهاض العلامة!
32= نبض المحرك خارج النطاق
33= الجلفانومتر دخارج النطاق!
34 = منصة المحور X الحد الإيجابي الفائق!
35 = منصة المحور X الحد الزائد عن السالب!
36 = حد إيجابي فائق للمحور الصادي للمنصة!
37 = منصة المحور Y الحد الزائد عن السالب!
38 = رأس الجلفانومتر المربع يعمل بشكل غير طبيعي ، يرجى إيقاف تشغيل الطاقة والتحقق!
54=الرجاء التبديل إلى جدول التصحيح !
55=الرجاء التبديل إلى جدول التصحيح !
100 = بوابة الأمان صالحة ومفتوحة!

110 = ضرب حد سلبي!
111 = ضرب حد إيجابي!
112 = ضرب الأصل في الحركة!
500=الجلفانومتر الاحماء، يرجى المحاولة مرة أخرى في وقت لاحق!

[door]
1 = باب الأمان مفتوح ، يرجى إغلاق باب الأمان!
2 = باب الأمان مفتوح ، يتم إيقاف العلامات مؤقتا ، يرجى إغلاق باب الأمان لمواصلة وضع العلامات!
3 = يتم فتح باب الأمان ، يتم إجهاض العلامات!
4 = باب الأمان مغلق ، يمكنك الاستمرار في وضع علامة!
5=باب الأمان مغلق والوضع طبيعي!
6 = تمت مصادفة الحد السلبي أثناء التمرين ، وتم إجهاض العلامات!
7 = تمت مصادفة الحد الموجب أثناء الحركة ، وتم إجهاض العلامة! 
[usb]
1 = بطاقة EMCC متصلة بالفعل
2=تم فصل بطاقة EMCC

[4101]
3 = وظيفة بطاقة DA 1 ومعلومات الإصدار
4=بطاقة DA 1 معلومات تاريخ الإصدار
5 = الوقت المنقضي لبطاقة DA 1
7 = عدد إطارات الخطأ لبطاقة DA 1
9 = بطاقة DA 1 العد التنازلي لوقت الخطأ 4 بت
11 = بطاقة DA 1 وقت العد التنازلي لخطأ بت 3
13 = بطاقة DA 1 العد التنازلي وقت خطأ بت 2
15 = وقت آخر خطأ بت على بطاقة DA 1

[4102]
4 = عدد الإطارات خارج التعليمات البرمجية لبطاقة DA 1
6 = بطاقة DA 1 العد التنازلي لوقت ملكة جمال 4
8 = بطاقة DA 1 العد التنازلي لوقت الرمز المفقود الثالث
10 = بطاقة DA 1 العد التنازلي لوقت الرمز الثاني المفقود
12 = بطاقة DA 1 غاب عن الوقت الماضي
14=بطاقة DA 1 معلومات إنذار الجلفانومتر
15 = بطاقة DA 1 إنذار الجلفانومتر قبالة تمكين الليزر

[4103]
3 = وظيفة بطاقة DA 2 ومعلومات الإصدار
4=بطاقة DA 2 معلومات تاريخ الإصدار
5 = الوقت المنقضي لبطاقة DA 2
7 = عدد إطارات الخطأ لبطاقة DA 2
9 = بطاقة DA 2 وقت العد التنازلي لخطأ 4 بت
11 = بطاقة DA 2 وقت العد التنازلي لخطأ بت 3
13 = بطاقة DA 2 العد التنازلي لوقت خطأ البت الثاني
15 = وقت خطأ البت الأخير على بطاقة DA 2

[4104]
4 = عدد الإطارات خارج التعليمات البرمجية لبطاقة DA 2
6 = بطاقة DA 2 العد التنازلي وقت ملكة جمال 4
8 = بطاقة DA 2 العد التنازلي لوقت ملكة جمال الثالثة
10 = بطاقة DA 2 وقت الخسارة قبل الأخير
12 = الوقت الذي ضاعت فيه بطاقة DA 2 آخر مرة
14=بطاقة DA 2 معلومات إنذار الجلفانومتر
15 = بطاقة DA 2 إنذار الجلفانومتر قبالة تمكين الليزر

[4105]
3 = وظيفة بطاقة الليزر ومعلومات الإصدار
4=معلومات تاريخ إصدار بطاقة الليزر
5 = الوقت المنقضي لبطاقة الليزر
7 = عدد إطارات الخطأ لبطاقة الليزر
9 = وقت خطأ البت قبل الأخير لبطاقة LASER
11 = وقت خطأ البت قبل الأخير لبطاقة LASER
13 = حان الوقت للعد التنازلي لخطأ البت الثاني لبطاقة LASER
15 = وقت خطأ البت الأخير على بطاقة LASER

[4106]
4 = عدد الإطارات المفقودة لبطاقة الليزر
6 = الوقت الذي تفقد فيه بطاقة LASER رمزها للعد التنازلي الرابع
8 = الوقت الذي تفقد فيه بطاقة LASER رمز العد التنازلي الثالث
10 = الوقت الذي تفقد فيه بطاقة LASER الرمز للمرة قبل الأخيرة الثانية
12 = آخر رمز مفقود لبطاقة LASER
14=رسالة إنذار الجلفانومتر بالليزر
15 = إنذار ليزر بطاقة الليزر قبالة تمكين الليزر

[4107]
3 = بطاقة الليزر الليزر الحالي NS الموجي
4 = بطاقة الليزر الليزر الحالي ps.
5 = بطاقة الليزر الليزر الحالي fs الموجي
6 = بطاقة ليزر يحافظ الليزر حاليا على الطاقة

[4102Warning]
0 = D0: بطاقة DA 1 اتصالات البيانات غير طبيعية
1 = D1: بطاقة DA 1 إنذار نظام الماسح الضوئي
2 = D2: بطاقة DA 1 إنذار درجة حرارة الماسح الضوئي
3 = D3: بطاقة DA 1 الماسح الضوئي إنذار السرعة المنخفضة
4 = D4: غير مستخدم
5 = D5: غير مستخدم
6 = D6: غير مستخدم
7 = D7: غير مستخدم
8=D8: غير مستخدم
9=D9: غير مستخدم
10 = D10: غير مستخدم
11=D11: غير مستخدم
12=D12: غير مستخدم
13=D13: غير مستخدم
14=D14: غير مستخدم
15 = D15: بطاقة EMCC اتصال البيانات غير طبيعي

[4104Warning]
0 = D0: بطاقة DA 2 اتصالات البيانات غير طبيعية
1 = D1: بطاقة DA 2 إنذار نظام الماسح الضوئي
2 = D2: بطاقة DA 2 إنذار درجة حرارة الماسح الضوئي
3 = D3: بطاقة DA 2 الماسح الضوئي إنذار منخفض السرعة
4 = D4: غير مستخدم
5 = D5: غير مستخدم
6 = D6: غير مستخدم
7 = D7: غير مستخدم
8=D8: غير مستخدم
9=D9: غير مستخدم
10 = D10: غير مستخدم
11=D11: غير مستخدم
12=D12: غير مستخدم
13=D13: غير مستخدم
14=D14: غير مستخدم
15=D15: غير مستخدم

[4106Warning]
0 = D0: اتصال بيانات بطاقة الليزر غير طبيعي
1 = D1: إنذار درجة حرارة الليزر
2 = D2: إنذار الطاقة
3 = D3: إنذار النظام
4 = D4: إنذار عالي مضاد للإنذار
5=D5: الليزر غير جاهز
6 = D6: فشل اشتعال ليزر البذور
7 = D7: إنذار درجة حرارة ليزر البذور
8 = D8: إنذار التيار الزائد MO
9 = D9: إنذار التيار الزائد PA
10 = D10: إنذار الموازاة
11=D11: اضغط على المنبه 5
12=D12: اضغط على المنبه 4
13=D13: اضغط على المنبه 3
14=D14: اضغط على المنبه 2
15=D15: اضغط على المنبه 1

[Refresh]
Interval= 500

